// размер клетки на доске
float step;

// диаметр поля
float d1;

// диаметр фишки
float d2;

final int EMPTY = 0;
final int WHITE = 1;
final int BLACK = 2;

// количество клеток на поле
final int N = 11;

// расположение фигур на поле
int[] b = new int[N];

// начальное расположение фигур на поле
int[] b0 = [
     0,    // 0
  0, 0, 0, // 1 2 3
  0, 2, 0, // 4 5 6
  1, 0, 1, // 7 8 9
     1     // 10
];

// Возможные ходы для белых (только вперед).
int[][] m = [
  [],
  [0,2],   [0,1,3],      [0,2],
  [1,5],   [1,2,3, 4,6], [3,5],
  [4,5,8], [7,5,9],      [6,5,8],
  [7,8,9]
];
